ПД_sev/src/Catalogs/ХранилищеПрикрепленныхФайлов/ХранилищеПрикрепленныхФайлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХранилищеПрикрепленныхФайлов</name>
  <attributes>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Хранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыПрикремленныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ПД_sev/src/Catalogs/ХранилищеПрикрепленныхФайлов/ManagerModule.bsl
Процедура ЗагрузитьФайлНаСервере(АдресФайла, ВыбранноеИмяФайла, СсылкаОбъект) Экспорт 
	Если АдресФайла = Неопределено Тогда
		Возврат	
	КонецЕсли;
	
	Файл = Новый Файл(ВыбранноеИмяФайла);
	ИмяФайла = Файл.Имя;
	Расширение = Файл.Расширение;
	НовыйЭлемент = Справочники.ХранилищеПрикрепленныхФайлов.СоздатьЭлемент();
	НовыйЭлемент.Объект = СсылкаОбъект; 
	НовыйЭлемент.Наименование = ТекущаяДата();
	НовыйЭлемент.ИмяФайла = ИмяФайла;
	НовыйЭлемент.Расширение = Расширение;
	НовыйЭлемент.Хранилище = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресФайла), Новый СжатиеДанных(9));
	Попытка
		НовыйЭлемент.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());	
	КонецПопытки;
КонецПроцедуры
